/* Copyright (c) 2019, isaponsoft (Isao Shibuya) All rights reserved. *
 * Use of this source code is governed by a BSD-style  license that   *
 * can be found in the LICENSE file.                                  */
#ifndef	__libamtrs__java__jnienv__hpp
#define	__libamtrs__java__jnienv__hpp
AMTRS_JAVA_NAMESPACE_BEGIN


// ============================================================================
//! JNIEnv* を取得します。
// ----------------------------------------------------------------------------
//! この関数はスレッドセーフです。また、事前にプラットフォームの指定する方法で
//! JNIEnv* を取得し、 set_jnienv() を呼び出しておく必要があります。
// ----------------------------------------------------------------------------
JNIEnv* get_jnienv();


// ============================================================================
//! JNIEnv* を設定します。
// ----------------------------------------------------------------------------
//! この関数はスレッドセーフです。
// ----------------------------------------------------------------------------
void set_jnienv(JNIEnv* _env);


// ============================================================================
//! JNIEnv* を取得します。
// ----------------------------------------------------------------------------
//! この関数はスレッドセーフです。また、事前にプラットフォームの指定する方法で
//! JNIEnv* を取得し、 set_jnienv() を呼び出しておく必要があります。
// ----------------------------------------------------------------------------
JavaVM* get_javavm();


// ============================================================================
//! JNIEnv* を設定します。
// ----------------------------------------------------------------------------
//! この関数はスレッドセーフです。
// ----------------------------------------------------------------------------
void set_javavm(JavaVM* _env);

AMTRS_JAVA_NAMESPACE_END
#endif
